MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH176/mcu.h
extern volatile __DDRCMDISSUEbits_t DDRCMDISSUEbits __asm__ ("DDRCMDISSUE") __attribute__((section("sfrs"), address(0xBF8E8048)));
#define DDRODTENCFG DDRODTENCFG
extern volatile uint32_t   DDRODTENCFG __attribute__((section("sfrs"), address(0xBF8E804C)));
typedef struct {
  uint32_t ODTREN:1;
  uint32_t :15;
  uint32_t ODTWEN:1;
} __DDRODTENCFGbits_t;
extern volatile __DDRODTENCFGbits_t DDRODTENCFGbits __asm__ ("DDRODTENCFG") __attribute__((section("sfrs"), address(0xBF8E804C)));
#define DDRMEMWIDTH DDRMEMWIDTH
extern volatile uint32_t   DDRMEMWIDTH __attribute__((section("sfrs"), address(0xBF8E8050)));
typedef struct {
  uint32_t :3;
  uint32_t HALFRATE:1;
} __DDRMEMWIDTHbits_t;
extern volatile __DDRMEMWIDTHbits_t DDRMEMWIDTHbits __asm__ ("DDRMEMWIDTH") __attribute__((section("sfrs"), address(0xBF8E8050)));
#define DDRCMD10 DDRCMD10
extern volatile uint32_t   DDRCMD10 __attribute__((section("sfrs"), address(0xBF8E8080)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD10bits_t;
extern volatile __DDRCMD10bits_t DDRCMD10bits __asm__ ("DDRCMD10") __attribute__((section("sfrs"), address(0xBF8E8080)));
#define DDRCMD11 DDRCMD11
extern volatile uint32_t   DDRCMD11 __attribute__((section("sfrs"), address(0xBF8E8084)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD11bits_t;
extern volatile __DDRCMD11bits_t DDRCMD11bits __asm__ ("DDRCMD11") __attribute__((section("sfrs"), address(0xBF8E8084)));
#define DDRCMD12 DDRCMD12
extern volatile uint32_t   DDRCMD12 __attribute__((section("sfrs"), address(0xBF8E8088)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD12bits_t;
extern volatile __DDRCMD12bits_t DDRCMD12bits __asm__ ("DDRCMD12") __attribute__((section("sfrs"), address(0xBF8E8088)));
#define DDRCMD13 DDRCMD13
extern volatile uint32_t   DDRCMD13 __attribute__((section("sfrs"), address(0xBF8E808C)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD13bits_t;
extern volatile __DDRCMD13bits_t DDRCMD13bits __asm__ ("DDRCMD13") __attribute__((section("sfrs"), address(0xBF8E808C)));
#define DDRCMD14 DDRCMD14
extern volatile uint32_t   DDRCMD14 __attribute__((section("sfrs"), address(0xBF8E8090)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD14bits_t;
extern volatile __DDRCMD14bits_t DDRCMD14bits __asm__ ("DDRCMD14") __attribute__((section("sfrs"), address(0xBF8E8090)));
#define DDRCMD15 DDRCMD15
extern volatile uint32_t   DDRCMD15 __attribute__((section("sfrs"), address(0xBF8E8094)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD15bits_t;
extern volatile __DDRCMD15bits_t DDRCMD15bits __asm__ ("DDRCMD15") __attribute__((section("sfrs"), address(0xBF8E8094)));
#define DDRCMD16 DDRCMD16
extern volatile uint32_t   DDRCMD16 __attribute__((section("sfrs"), address(0xBF8E8098)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD16bits_t;
extern volatile __DDRCMD16bits_t DDRCMD16bits __asm__ ("DDRCMD16") __attribute__((section("sfrs"), address(0xBF8E8098)));
#define DDRCMD17 DDRCMD17
extern volatile uint32_t   DDRCMD17 __attribute__((section("sfrs"), address(0xBF8E809C)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD17bits_t;
extern volatile __DDRCMD17bits_t DDRCMD17bits __asm__ ("DDRCMD17") __attribute__((section("sfrs"), address(0xBF8E809C)));
#define DDRCMD18 DDRCMD18
extern volatile uint32_t   DDRCMD18 __attribute__((section("sfrs"), address(0xBF8E80A0)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD18bits_t;
extern volatile __DDRCMD18bits_t DDRCMD18bits __asm__ ("DDRCMD18") __attribute__((section("sfrs"), address(0xBF8E80A0)));
#define DDRCMD19 DDRCMD19
extern volatile uint32_t   DDRCMD19 __attribute__((section("sfrs"), address(0xBF8E80A4)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD19bits_t;
extern volatile __DDRCMD19bits_t DDRCMD19bits __asm__ ("DDRCMD19") __attribute__((section("sfrs"), address(0xBF8E80A4)));
#define DDRCMD110 DDRCMD110
extern volatile uint32_t   DDRCMD110 __attribute__((section("sfrs"), address(0xBF8E80A8)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD110bits_t;
extern volatile __DDRCMD110bits_t DDRCMD110bits __asm__ ("DDRCMD110") __attribute__((section("sfrs"), address(0xBF8E80A8)));
#define DDRCMD111 DDRCMD111
extern volatile uint32_t   DDRCMD111 __attribute__((section("sfrs"), address(0xBF8E80AC)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD111bits_t;
extern volatile __DDRCMD111bits_t DDRCMD111bits __asm__ ("DDRCMD111") __attribute__((section("sfrs"), address(0xBF8E80AC)));
#define DDRCMD112 DDRCMD112
extern volatile uint32_t   DDRCMD112 __attribute__((section("sfrs"), address(0xBF8E80B0)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD112bits_t;
extern volatile __DDRCMD112bits_t DDRCMD112bits __asm__ ("DDRCMD112") __attribute__((section("sfrs"), address(0xBF8E80B0)));
#define DDRCMD113 DDRCMD113
extern volatile uint32_t   DDRCMD113 __attribute__((section("sfrs"), address(0xBF8E80B4)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD113bits_t;
