MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH176/mcu.h
extern volatile __SBT8REG1bits_t SBT8REG1bits __asm__ ("SBT8REG1") __attribute__((section("sfrs"), address(0xBF908880)));
#define SBT8RD1 SBT8RD1
extern volatile uint32_t   SBT8RD1 __attribute__((section("sfrs"), address(0xBF908890)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8RD1bits_t;
extern volatile __SBT8RD1bits_t SBT8RD1bits __asm__ ("SBT8RD1") __attribute__((section("sfrs"), address(0xBF908890)));
#define SBT8WR1 SBT8WR1
extern volatile uint32_t   SBT8WR1 __attribute__((section("sfrs"), address(0xBF908898)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8WR1bits_t;
extern volatile __SBT8WR1bits_t SBT8WR1bits __asm__ ("SBT8WR1") __attribute__((section("sfrs"), address(0xBF908898)));
#define SBT9ELOG1 SBT9ELOG1
extern volatile uint32_t   SBT9ELOG1 __attribute__((section("sfrs"), address(0xBF908C20)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT9ELOG1bits_t;
extern volatile __SBT9ELOG1bits_t SBT9ELOG1bits __asm__ ("SBT9ELOG1") __attribute__((section("sfrs"), address(0xBF908C20)));
#define SBT9ELOG2 SBT9ELOG2
extern volatile uint32_t   SBT9ELOG2 __attribute__((section("sfrs"), address(0xBF908C24)));
typedef struct {
  uint32_t GROUP:2;
} __SBT9ELOG2bits_t;
extern volatile __SBT9ELOG2bits_t SBT9ELOG2bits __asm__ ("SBT9ELOG2") __attribute__((section("sfrs"), address(0xBF908C24)));
#define SBT9ECON SBT9ECON
extern volatile uint32_t   SBT9ECON __attribute__((section("sfrs"), address(0xBF908C28)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT9ECONbits_t;
extern volatile __SBT9ECONbits_t SBT9ECONbits __asm__ ("SBT9ECON") __attribute__((section("sfrs"), address(0xBF908C28)));
#define SBT9ECLRS SBT9ECLRS
extern volatile uint32_t   SBT9ECLRS __attribute__((section("sfrs"), address(0xBF908C30)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT9ECLRSbits_t;
extern volatile __SBT9ECLRSbits_t SBT9ECLRSbits __asm__ ("SBT9ECLRS") __attribute__((section("sfrs"), address(0xBF908C30)));
#define SBT9ECLRM SBT9ECLRM
extern volatile uint32_t   SBT9ECLRM __attribute__((section("sfrs"), address(0xBF908C38)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT9ECLRMbits_t;
extern volatile __SBT9ECLRMbits_t SBT9ECLRMbits __asm__ ("SBT9ECLRM") __attribute__((section("sfrs"), address(0xBF908C38)));
#define SBT9REG0 SBT9REG0
extern volatile uint32_t   SBT9REG0 __attribute__((section("sfrs"), address(0xBF908C40)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT9REG0bits_t;
extern volatile __SBT9REG0bits_t SBT9REG0bits __asm__ ("SBT9REG0") __attribute__((section("sfrs"), address(0xBF908C40)));
#define SBT9RD0 SBT9RD0
extern volatile uint32_t   SBT9RD0 __attribute__((section("sfrs"), address(0xBF908C50)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9RD0bits_t;
extern volatile __SBT9RD0bits_t SBT9RD0bits __asm__ ("SBT9RD0") __attribute__((section("sfrs"), address(0xBF908C50)));
#define SBT9WR0 SBT9WR0
extern volatile uint32_t   SBT9WR0 __attribute__((section("sfrs"), address(0xBF908C58)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9WR0bits_t;
extern volatile __SBT9WR0bits_t SBT9WR0bits __asm__ ("SBT9WR0") __attribute__((section("sfrs"), address(0xBF908C58)));
#define SBT9REG1 SBT9REG1
extern volatile uint32_t   SBT9REG1 __attribute__((section("sfrs"), address(0xBF908C60)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT9REG1bits_t;
extern volatile __SBT9REG1bits_t SBT9REG1bits __asm__ ("SBT9REG1") __attribute__((section("sfrs"), address(0xBF908C60)));
#define SBT9RD1 SBT9RD1
extern volatile uint32_t   SBT9RD1 __attribute__((section("sfrs"), address(0xBF908C70)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9RD1bits_t;
extern volatile __SBT9RD1bits_t SBT9RD1bits __asm__ ("SBT9RD1") __attribute__((section("sfrs"), address(0xBF908C70)));
#define SBT9WR1 SBT9WR1
extern volatile uint32_t   SBT9WR1 __attribute__((section("sfrs"), address(0xBF908C78)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9WR1bits_t;
extern volatile __SBT9WR1bits_t SBT9WR1bits __asm__ ("SBT9WR1") __attribute__((section("sfrs"), address(0xBF908C78)));
#define SBT10ELOG1 SBT10ELOG1
extern volatile uint32_t   SBT10ELOG1 __attribute__((section("sfrs"), address(0xBF909020)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT10ELOG1bits_t;
extern volatile __SBT10ELOG1bits_t SBT10ELOG1bits __asm__ ("SBT10ELOG1") __attribute__((section("sfrs"), address(0xBF909020)));
#define SBT10ELOG2 SBT10ELOG2
extern volatile uint32_t   SBT10ELOG2 __attribute__((section("sfrs"), address(0xBF909024)));
typedef struct {
  uint32_t GROUP:2;
} __SBT10ELOG2bits_t;
extern volatile __SBT10ELOG2bits_t SBT10ELOG2bits __asm__ ("SBT10ELOG2") __attribute__((section("sfrs"), address(0xBF909024)));
#define SBT10ECON SBT10ECON
extern volatile uint32_t   SBT10ECON __attribute__((section("sfrs"), address(0xBF909028)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT10ECONbits_t;
extern volatile __SBT10ECONbits_t SBT10ECONbits __asm__ ("SBT10ECON") __attribute__((section("sfrs"), address(0xBF909028)));
#define SBT10ECLRS SBT10ECLRS
extern volatile uint32_t   SBT10ECLRS __attribute__((section("sfrs"), address(0xBF909030)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT10ECLRSbits_t;
extern volatile __SBT10ECLRSbits_t SBT10ECLRSbits __asm__ ("SBT10ECLRS") __attribute__((section("sfrs"), address(0xBF909030)));
#define SBT10ECLRM SBT10ECLRM
extern volatile uint32_t   SBT10ECLRM __attribute__((section("sfrs"), address(0xBF909038)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT10ECLRMbits_t;
extern volatile __SBT10ECLRMbits_t SBT10ECLRMbits __asm__ ("SBT10ECLRM") __attribute__((section("sfrs"), address(0xBF909038)));
#define SBT10REG0 SBT10REG0
extern volatile uint32_t   SBT10REG0 __attribute__((section("sfrs"), address(0xBF909040)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT10REG0bits_t;
