MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH176/mcu.h
#define _SBT16REG4_BASE_POSITION                 0x0000000A
#define _SBT16REG4_BASE_MASK                     0xFFFFFC00
#define _SBT16REG4_BASE_LENGTH                   0x00000016

#define _SBT16RD4_GROUP0_POSITION                0x00000000
#define _SBT16RD4_GROUP0_MASK                    0x00000001
#define _SBT16RD4_GROUP0_LENGTH                  0x00000001

#define _SBT16RD4_GROUP1_POSITION                0x00000001
#define _SBT16RD4_GROUP1_MASK                    0x00000002
#define _SBT16RD4_GROUP1_LENGTH                  0x00000001

#define _SBT16RD4_GROUP2_POSITION                0x00000002
#define _SBT16RD4_GROUP2_MASK                    0x00000004
#define _SBT16RD4_GROUP2_LENGTH                  0x00000001

#define _SBT16RD4_GROUP3_POSITION                0x00000003
#define _SBT16RD4_GROUP3_MASK                    0x00000008
#define _SBT16RD4_GROUP3_LENGTH                  0x00000001

#define _SBT16WR4_GROUP0_POSITION                0x00000000
#define _SBT16WR4_GROUP0_MASK                    0x00000001
#define _SBT16WR4_GROUP0_LENGTH                  0x00000001

#define _SBT16WR4_GROUP1_POSITION                0x00000001
#define _SBT16WR4_GROUP1_MASK                    0x00000002
#define _SBT16WR4_GROUP1_LENGTH                  0x00000001

#define _SBT16WR4_GROUP2_POSITION                0x00000002
#define _SBT16WR4_GROUP2_MASK                    0x00000004
#define _SBT16WR4_GROUP2_LENGTH                  0x00000001

#define _SBT16WR4_GROUP3_POSITION                0x00000003
#define _SBT16WR4_GROUP3_MASK                    0x00000008
#define _SBT16WR4_GROUP3_LENGTH                  0x00000001

#define _USBIE0CSR0_TXMAXP_POSITION              0x00000000
#define _USBIE0CSR0_TXMAXP_MASK                  0x000007FF
#define _USBIE0CSR0_TXMAXP_LENGTH                0x0000000B

#define _USBIE0CSR0_RXRDY_POSITION               0x00000010
#define _USBIE0CSR0_RXRDY_MASK                   0x00010000
#define _USBIE0CSR0_RXRDY_LENGTH                 0x00000001

#define _USBIE0CSR0_TXRDY_POSITION               0x00000011
#define _USBIE0CSR0_TXRDY_MASK                   0x00020000
#define _USBIE0CSR0_TXRDY_LENGTH                 0x00000001

#define _USBIE0CSR0_STALLED_POSITION             0x00000012
#define _USBIE0CSR0_STALLED_MASK                 0x00040000
#define _USBIE0CSR0_STALLED_LENGTH               0x00000001

#define _USBIE0CSR0_SETUP_POSITION               0x00000013
#define _USBIE0CSR0_SETUP_MASK                   0x00080000
#define _USBIE0CSR0_SETUP_LENGTH                 0x00000001

#define _USBIE0CSR0_ERROR_POSITION               0x00000014
#define _USBIE0CSR0_ERROR_MASK                   0x00100000
#define _USBIE0CSR0_ERROR_LENGTH                 0x00000001

#define _USBIE0CSR0_REQPKT_POSITION              0x00000015
#define _USBIE0CSR0_REQPKT_MASK                  0x00200000
#define _USBIE0CSR0_REQPKT_LENGTH                0x00000001

#define _USBIE0CSR0_STATUS_POSITION              0x00000016
#define _USBIE0CSR0_STATUS_MASK                  0x00400000
#define _USBIE0CSR0_STATUS_LENGTH                0x00000001

#define _USBIE0CSR0_NAKTO_POSITION               0x00000017
#define _USBIE0CSR0_NAKTO_MASK                   0x00800000
#define _USBIE0CSR0_NAKTO_LENGTH                 0x00000001

#define _USBIE0CSR0_FLUSH_POSITION               0x00000018
#define _USBIE0CSR0_FLUSH_MASK                   0x01000000
#define _USBIE0CSR0_FLUSH_LENGTH                 0x00000001

#define _USBIE0CSR0_DT_POSITION                  0x00000019
#define _USBIE0CSR0_DT_MASK                      0x02000000
#define _USBIE0CSR0_DT_LENGTH                    0x00000001

#define _USBIE0CSR0_DTWE_POSITION                0x0000001A
#define _USBIE0CSR0_DTWE_MASK                    0x04000000
#define _USBIE0CSR0_DTWE_LENGTH                  0x00000001

#define _USBIE0CSR0_DATAEND_POSITION             0x00000013
#define _USBIE0CSR0_DATAEND_MASK                 0x00080000
#define _USBIE0CSR0_DATAEND_LENGTH               0x00000001

#define _USBIE0CSR0_SETEND_POSITION              0x00000014
#define _USBIE0CSR0_SETEND_MASK                  0x00100000
#define _USBIE0CSR0_SETEND_LENGTH                0x00000001

#define _USBIE0CSR0_STALL_POSITION               0x00000015
#define _USBIE0CSR0_STALL_MASK                   0x00200000
#define _USBIE0CSR0_STALL_LENGTH                 0x00000001

#define _USBIE0CSR0_RXRDYC_POSITION              0x00000016
#define _USBIE0CSR0_RXRDYC_MASK                  0x00400000
#define _USBIE0CSR0_RXRDYC_LENGTH                0x00000001

#define _USBIE0CSR0_SETENDC_POSITION             0x00000017
#define _USBIE0CSR0_SETENDC_MASK                 0x00800000
#define _USBIE0CSR0_SETENDC_LENGTH               0x00000001

#define _USBIENCSR0_TXMAXP_POSITION              0x00000000
#define _USBIENCSR0_TXMAXP_MASK                  0x000007FF
#define _USBIENCSR0_TXMAXP_LENGTH                0x0000000B

#define _USBIENCSR0_MULT_POSITION                0x0000000B
#define _USBIENCSR0_MULT_MASK                    0x0000F800
#define _USBIENCSR0_MULT_LENGTH                  0x00000005

#define _USBIENCSR0_TXPKTRDY_POSITION            0x00000010
#define _USBIENCSR0_TXPKTRDY_MASK                0x00010000
#define _USBIENCSR0_TXPKTRDY_LENGTH              0x00000001

#define _USBIENCSR0_FIFONE_POSITION              0x00000011
#define _USBIENCSR0_FIFONE_MASK                  0x00020000
#define _USBIENCSR0_FIFONE_LENGTH                0x00000001

#define _USBIENCSR0_ERROR_POSITION               0x00000012
#define _USBIENCSR0_ERROR_MASK                   0x00040000
#define _USBIENCSR0_ERROR_LENGTH                 0x00000001

#define _USBIENCSR0_FLUSH_POSITION               0x00000013
#define _USBIENCSR0_FLUSH_MASK                   0x00080000
#define _USBIENCSR0_FLUSH_LENGTH                 0x00000001

#define _USBIENCSR0_SETUPPKT_POSITION            0x00000014
#define _USBIENCSR0_SETUPPKT_MASK                0x00100000
#define _USBIENCSR0_SETUPPKT_LENGTH              0x00000001

#define _USBIENCSR0_RXSTALL_POSITION             0x00000015
#define _USBIENCSR0_RXSTALL_MASK                 0x00200000
#define _USBIENCSR0_RXSTALL_LENGTH               0x00000001

